'use strict';


// const total = 100;
// let ordered = 50;

// console.log(
//     ordered > total ?
//     'На складе недостаточно твоаров!' :
//     'Заказ оформлен, с вами свяжется менеджер',
// );

// ordered = 20;

// console.log(
//     ordered > total ?
//     'На складе недостаточно твоаров!' :
//     'Заказ оформлен, с вами свяжется менеджер',
// );
// ordered = 80;

// console.log(
//     ordered > total ?
//     'На складе недостаточно твоаров!' :
//     'Заказ оформлен, с вами свяжется менеджер',
// );

// ordered = 130;

// console.log(
//     ordered > total ?
//     'На складе недостаточно твоаров!' :
//     'Заказ оформлен, с вами свяжется менеджер',
// );

// ordered = 100;

// console.log(
//     ordered > total ?
//     'На складе недостаточно твоаров!' :
//     'Заказ оформлен, с вами свяжется менеджер',
// );

// ordered = 101;

// console.log(
//     ordered > total ?
//     'На складе недостаточно твоаров!' :
//     'Заказ оформлен, с вами свяжется менеджер',
// );

// ================================================

const total = 100;
let ordered = prompt('Сколько Вы хотите?');

alert(
    ordered > total ?
    'На складе недостаточно твоаров!' :
    'Заказ оформлен, с вами свяжется менеджер',
);